IdeaRS.Connections
AnchoringData Class
Compatible with IDEA StatiCa 0.0
 Represents properties of the weld
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.AnchoringData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class AnchoringData : ConnectionCmdData
The AnchoringData type exposes the following members.
Constructors
Name | Description
AnchoringData
 Constructor
Top
Properties
Name | Description
Angles
 Gets or sets the string, where are defined groups and positions for angles. This string is not null or empty, if polar coordinate system is used.
AnchorLength
 Gets or sets the length of the anchor
AnchorName
 Gets or sets the name of the anchor
AnchorTypeData
 Various type of anchor
AnchorTypeDataSize
 Size of washer plate
ApplyBoltShearType
 Indicates type of shear transfer
CircularLayerRadius
 Gets or sets the array of radiuses of circular layers
Cols
 Gets or sets the string, where are defined groups and positions for columns.
CustomLcsAngle
 Gets or sets the angle of lcs for custom location of reference point.
CustomReferencePoint
 Gets or sets the shift of reference point.
CustomReferencePointPosition
 Gets or sets the type of position of reference point located from.
EditorData
 Gets or sets data which are generated by connector editor. It includes information about changes of the connectors.
GridType
 Gets or sets the type of grid - regular or shifted.
HorizontalGridLinesBottom
 The array of offsets of the horizontal gridlines from the top edge of the bounding box
HorizontalGridLinesTop
 The array of offsets of the horizontal gridlines from the top edge of the bounding box
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
NumberOfAnchorsCL
 Gets or sets the array where are defined numers of anchors in particular circular layers
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PositionType
 Gets or sets the type for building of connectors geometry.
ReferencePointPosition
 Gets or sets the type of position of reference point.
Rows
 Gets or sets the string, where are defined groups and positions for rows.
ShearPlaneThread
 Indicates if shear plane is in thread (smaller area)
VerticalGridLinesLeft
 The array of offsets of the vertical gridlines from the left edge of the bounding box
VerticalGridLinesRight
 The array of offsets of the vertical gridlines from the right edge of the bounding box
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace